---
kind: event
id: E:Autodesk.Revit.UI.UIApplication.DisplayingOptionsDialog
source: html/7d12db51-950c-b506-f23d-19c1e58bd615.htm
---
# Autodesk.Revit.UI.UIApplication.DisplayingOptionsDialog Event

Subscribe to the options dialog displaying event to be notified when Revit options dialog is displaying.

## Syntax (C#)
```csharp
public event EventHandler<DisplayingOptionsDialogEventArgs> DisplayingOptionsDialog
```